Documents/Renault_СписаниеПТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_СписаниеПТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Renault_ОстаткиПТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании на который поступают товары</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Renault_ОстаткиПТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_ОстаткиПТС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Renault_СписаниеПТС/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Renault_ОстаткиПТС.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_СписаниеПТС.ПТС,
		|	Renault_СписаниеПТС.Ссылка.СкладКомпании,
		|	ЕСТЬNULL(Renault_ОстаткиПТСОстатки.КоличествоОстаток, 0) КАК Остаток
		|ИЗ
		|	Документ.Renault_СписаниеПТС.Состав КАК Renault_СписаниеПТС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_ОстаткиПТС.Остатки(&МоментВремени, ) КАК Renault_ОстаткиПТСОстатки
		|		ПО Renault_СписаниеПТС.ПТС = Renault_ОстаткиПТСОстатки.ПТС
		|			И Renault_СписаниеПТС.Ссылка.СкладКомпании = Renault_ОстаткиПТСОстатки.Склад
		|ГДЕ
		|	Renault_СписаниеПТС.Ссылка = &Ссылка
		|	И ЕСТЬNULL(Renault_ОстаткиПТСОстатки.КоличествоОстаток, 0) <= 0";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщить("Нет на складе "+ Выборка.ПТС);
		Отказ = Истина;
	КонецЦикла;

	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.Renault_ОстаткиПТС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = СкладКомпании;
		Движение.ПТС = ТекСтрокаСостав.ПТС;
		Движение.Количество = 1;
	КонецЦикла;

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	УникальныеПТС = Состав.Выгрузить(,"ПТС");
	УникальныеПТС.Свернуть("ПТС");
	Если УникальныеПТС.Количество() <> Состав.Количество() Тогда
		Сообщить("В списке документов ПТС есть повторяющиеся строки");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
